#pragma once

//Файл, сохраненный с расширением h, представляет собой заголовочный файл, для включения объявлений переменных, констант и функций. На них ссылаются файлы реализации C++, которые содержат фактическую реализацию этих функций. Файл заголовка .h также может содержать дополнительную информацию, например определения макросов. На эти заголовочные файлы ссылаются в файлах C/C++ с помощью директивы #include.


class Calculator
{
	public:
		double Calculate(double x, char oper, double y);
};

